app/controllers/pdfs_controller.rb

    def index
        @pdfs = Pdf.all
---
SELECT "pdfs".* FROM "pdfs"

    def show
         @pdf = Pdf.find(params[:id])
---
SELECT  "pdfs".* FROM "pdfs"  WHERE "pdfs"."id" = ? LIMIT 1  [["id", 6]]